[
{"table": "arctype", "typeName": "Церкви та монастирі", "id": 1},
{"table": "arctype", "typeName": "Оборонні споруди", "id": 2},
{"table": "arctype", "typeName": "Цивільна аріхітектура", "id": 3},
{"table": "arcobj", "objectName": "Преображенська церква", "desrc": "Преображенська церква постала на місці костелу Тринітаріїв, котрі прибули з Іспанії і заклали свій монастир у 1703 році біля Краківської брами. За розпорядженням цісаря Йосифа у 1783 році монастир закрили, а в його приміщеннях влаштували бібліотеку та актовий зал університету.В 1848 року під час революційних подій університетські будівлі були зруйновані артилерійським вогнем та пожежею, університет перебрався на вул. Святого Миколая (тепер Грушевського), а зруйновані будівлі цісар Франц Йосиф І подарував русинам, котрі збудували тут у 1851-1864 роках Народний дім, який мав стати репрезентаційним та культурним осередком галицьких українців.А поряд на базі збережених мурів колишнього костелу тринітаріїв почалось спорудження другої (після Успенської) церкви для львівського середмістя. Аж 1874 року було затверджено проект храму, розроблений Сильвестром Гавришкевичем. Будівництво тривало двадцять років, ще кілька років велись роботи над оздобленням Преображенської церкви. В 1906 році митрополит Галицький Андрей Шептицький освятив Преображенську церкву.Преображенська церква першою в Україні повернулася в лоно греко-католицької церкви.", "curAddr": "Сучасна адреса: вул.Краківська, 21.", "image": "Transfiguration Church.png", "type_id": 1, "id": 1},
{"table": "arcobj", "objectName": "Костел Івана Хрестителя", "desrc": "Костел святого Івана Хрестителя, який розташовується в північно-східній частині площі Старий Ринок, є одним з найдавніших храмів Львова. Точна дата побудови святині невідома і досі є дискусійною серед дослідників історії давнього Львова. Серед можливих дат побудови фігурують такі роки - 1201, 1234, 1250, 1260, 1270 і 1370. Костел переходив з рук в руки - від католиків до вірмен-уніатів і назад, горів, руйнувався і реставрувався. Із внутрішнього облаштування костелу практично нічого не збереглося. Зараз в ньому існує музей.", "curAddr": "Сучасна адреса: вул.Ужгородська, 8А.", "image": "Church of John the Baptist.png", "type_id": 1, "id": 2},
{"table": "arcobj", "objectName": "Міський арсенал", "desrc": "Найдавніший міський арсенал було примуровано до 1430 р. до Низького муру. Після пожежі 1527 р. арсенал розібрали і до 1556 р. нову одноярусну будівлю арсеналу прибудували до Високого муру Львова, залишки якого видно з вулиці Арсенальної. Після нової пожежі арсенал відбудували двоярусним (1574—1575), а з 1582 при ньому облаштували людвисарню для відливання гармат. При реконструкції 1670-х років арсенал отримав третій ярус. Значно потерпів від пожежі 1703 р., коли від вибуху пороху обвалилось склепіння і утворились проломи у стінах. Будівля арсеналу виконана з каменю, двоповерхова, прямокутна в плані, з невеликою восьмикутною вежею на північній стороні. У XVIII столітті в підвалах львівського міського арсеналу тримали полонених українських козаків і гайдамаків. В одному з казематів знаходилася камера тортур і житло міського ката.", "curAddr": "Сучасна адреса: вул.Підвальна, 5.", "image": "City Arsenal.png", "type_id": 1, "id": 3}
]